### 4일차 과제
- 생존자 분석
- 결측치 처리, 카테고리 정리 등등 배운거 다써보셈

In [1]:
import pandas as pd

In [2]:
file_path = '../data/titanic.csv'

In [3]:
data = pd.read_csv(file_path)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [5]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
data.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [7]:
data.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [8]:
data['age'] = data['age'].fillna(0)
data['age'].isna().sum()

np.int64(0)

In [9]:
data['deck'] = data['deck'].fillna('-')
data['deck'].isna().sum()

np.int64(0)

In [10]:
data['embark_town'] = data['embark_town'].fillna('-')
data['embark_town'].isna().sum()

np.int64(0)

In [11]:
data['embarked'] = data['embarked'].fillna('na')
data['embarked'].isna().sum()

np.int64(0)

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         891 non-null    object
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [13]:
data.duplicated().sum()

np.int64(107)

In [14]:
data[data.duplicated()].index   # 뭘 기준으로 중복이라고 하는지 모르겠네...

Index([ 47,  76,  77,  87,  95, 101, 121, 133, 173, 196,
       ...
       838, 844, 846, 859, 863, 870, 877, 878, 884, 886],
      dtype='int64', length=107)

- 숫자인데 범주형인 데이터 : pclass, sibsp, parch, class
- 문자형인데 범주형인 데이터 : sex, who, adult_male, alone, embark_town
- fare 항목은 뭔가 애매함.

- 행 중복은 일단 넘기고 열 중복 체크
    - survived : alive, pclass : class

In [15]:
(data['survived'] == data['alive']).sum()

np.int64(0)

In [16]:
# 아차차
(data['survived'].replace([0, 1], ['no', 'yes']) == data['alive']).sum()

np.int64(891)

In [17]:
(data['pclass'] == data['class'].replace(['First', 'Second', 'Third'], [1, 2, 3])).sum()

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_14520\1422182148.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  (data['pclass'] == data['class'].replace(['First', 'Second', 'Third'], [1, 2, 3])).sum()

np.int64(891)

In [18]:
data['class'].replace(['First', 'Second', 'Third'], [1, 2, 3]).value_counts()  # 뭐지? 왜 개수가 달라?

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_14520\459519995.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['class'].replace(['First', 'Second', 'Third'], [1, 2, 3]).value_counts()  # 뭐지? 왜 개수가 달라?

class
3    491
1    216
2    184
Name: count, dtype: int64

In [19]:
data['pclass'].value_counts()   # 아.. 오타...

pclass
3    491
1    216
2    184
Name: count, dtype: int64

- sex, who, adult_male 비교

In [20]:
(data['sex'].replace(['male', 'female'], ['man', 'woman'])).value_counts()

sex
man      577
woman    314
Name: count, dtype: int64

In [21]:
data['who'].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

In [22]:
data['adult_male'].value_counts()

adult_male
True     537
False    354
Name: count, dtype: int64

In [23]:
((data['who'] == 'child') & (data['adult_male'] == False) & (data['sex'] == 'male')).sum()    # 성인남자 537, 성인여자 271, 남자아이 40, 여자아이 43

np.int64(40)

In [24]:
((data['sex'] == 'female') & (data['adult_male'] == False) & (data['who'] == 'child')).sum()

np.int64(43)

In [25]:
((data['sex'] == 'male') & (data['adult_male'] == True)).sum()

np.int64(537)

In [26]:
((data['sex'] == 'female') & (data['who'] == 'woman')).sum()

np.int64(271)

In [27]:
# 이제 이걸 합쳐야 하는데.. 어케 하징?
# 일단은 인덱스를 만들자.

boy = data[((data['who'] == 'child') & (data['adult_male'] == False) & (data['sex'] == 'male'))]
boy_idx = boy.index

girl = data[((data['sex'] == 'female') & (data['adult_male'] == False) & (data['who'] == 'child'))]
girl_idx = girl.index

man = data[((data['sex'] == 'male') & (data['adult_male'] == True))]
man_idx = man.index

woman = data[((data['sex'] == 'female') & (data['who'] == 'woman'))]
woman_idx = woman.index

print(boy_idx, girl_idx, man_idx, woman_idx, sep='\n\n')

Index([  7,  16,  50,  59,  63,  78, 125, 164, 165, 171, 182, 183, 193, 261,
       278, 305, 340, 348, 352, 386, 407, 445, 480, 489, 549, 683, 686, 731,
       751, 755, 787, 788, 802, 803, 819, 824, 827, 831, 850, 869],
      dtype='int64')

Index([  9,  10,  14,  22,  24,  39,  43,  58, 111, 119, 147, 172, 184, 205,
       233, 237, 297, 374, 381, 419, 435, 446, 448, 469, 479, 530, 535, 541,
       542, 618, 634, 642, 644, 689, 691, 720, 750, 777, 780, 813, 830, 852,
       875],
      dtype='int64')

Index([  0,   4,   5,   6,  12,  13,  17,  20,  21,  23,
       ...
       873, 876, 877, 878, 881, 883, 884, 886, 889, 890],
      dtype='int64', length=537)

Index([  1,   2,   3,   8,  11,  15,  18,  19,  25,  28,
       ...
       865, 866, 871, 874, 879, 880, 882, 885, 887, 888],
      dtype='int64', length=271)

In [28]:
# 성인남자, 성인여자, 남자아이, 여자아이 를 포함하는 범주가 뭐지?
data['gender'] = '-'
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         891 non-null    object
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  gender       891 non-null    object
dtypes: bool(2), float64(2), int64(4), object(8)
memory usage: 99.3+ KB

In [29]:
data.loc[man_idx, 'gender'] = 'man'
data.loc[woman_idx, 'gender'] = 'woman'
data.loc[boy_idx, 'gender'] = 'boy'
data.loc[girl_idx, 'gender'] = 'girl'

In [30]:
data['gender'].value_counts()

gender
man      537
woman    271
girl      43
boy       40
Name: count, dtype: int64

In [31]:
# 다시한번 행 중복 검사
data.duplicated().sum() # 왜?

np.int64(107)

In [32]:
# 이렇게 된 이상 날릴지 말지를 정하기 위해 여러 인덱스를 보자!
print(data[data.duplicated()].index, data[data.duplicated(keep='last')].index, sep='\n\n')

Index([ 47,  76,  77,  87,  95, 101, 121, 133, 173, 196,
       ...
       838, 844, 846, 859, 863, 870, 877, 878, 884, 886],
      dtype='int64', length=107)

Index([  4,  26,  28,  29,  32,  37,  42,  45,  46,  47,
       ...
       658, 674, 722, 733, 738, 739, 784, 792, 795, 832],
      dtype='int64', length=107)

- 실제 데이터에서 인덱스를 찾아서 모아보니 진짜 ㄹㅇ 다 중복되는 데이터 였음.
- 여기서 나온 행 중복을 완전히 날리는 것도 아닌것 같음.
- DataFrame을 날린거랑 안 날린거랑 비교해도 괜찮지 않을까?

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         891 non-null    object
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  gender       891 non-null    object
dtypes: bool(2), float64(2), int64(4), object(8)
memory usage: 99.3+ KB

In [34]:
# 필요없는 컬럼 삭제
df_1 = data.drop(columns=['sex', 'class', 'who', 'adult_male', 'alive', 'embarked', 'deck'])
df_2 = df_1.drop_duplicates()

In [35]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   age          891 non-null    float64
 3   sibsp        891 non-null    int64
 4   parch        891 non-null    int64
 5   fare         891 non-null    float64
 6   embark_town  891 non-null    object
 7   alone        891 non-null    bool
 8   gender       891 non-null    object
dtypes: bool(1), float64(2), int64(4), object(2)
memory usage: 56.7+ KB

In [36]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 780 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     780 non-null    int64
 1   pclass       780 non-null    int64
 2   age          780 non-null    float64
 3   sibsp        780 non-null    int64
 4   parch        780 non-null    int64
 5   fare         780 non-null    float64
 6   embark_town  780 non-null    object
 7   alone        780 non-null    bool
 8   gender       780 non-null    object
dtypes: bool(1), float64(2), int64(4), object(2)
memory usage: 55.6+ KB

- 이제 각 컬럼별로 상관관계 분석

In [37]:
df_1.corr(numeric_only=True)

          survived    pclass       age     sibsp     parch      fare     alone
survived  1.000000 -0.338481  0.010539 -0.035322  0.081629  0.257307 -0.203367
pclass   -0.338481  1.000000 -0.361353  0.083081  0.018443 -0.549500  0.135207
age       0.010539 -0.361353  1.000000 -0.184664 -0.048786  0.135516  0.030880
sibsp    -0.035322  0.083081 -0.184664  1.000000  0.414838  0.159651 -0.584471
parch     0.081629  0.018443 -0.048786  0.414838  1.000000  0.216225 -0.583398
fare      0.257307 -0.549500  0.135516  0.159651  0.216225  1.000000 -0.271832
alone    -0.203367  0.135207  0.030880 -0.584471 -0.583398 -0.271832  1.000000

In [38]:
((0.5 < df_1.corr(numeric_only=True)) & (df_1.corr(numeric_only=True) < 1)).sum()   # 강한 상관관계를 보이는 데이터가 없음.

survived    0
pclass      0
age         0
sibsp       0
parch       0
fare        0
alone       0
dtype: int64

In [39]:
df_2.corr(numeric_only=True)    # 마찬가지로 강한 상관관계를 보이는 칼럼이 없음.

          survived    pclass       age     sibsp     parch      fare     alone
survived  1.000000 -0.336244 -0.045815 -0.037597  0.069669  0.246669 -0.175864
pclass   -0.336244  1.000000 -0.315072  0.086788  0.038975 -0.552440  0.112711
age      -0.045815 -0.315072  1.000000 -0.210027 -0.085102  0.102370  0.092418
sibsp    -0.037597  0.086788 -0.210027  1.000000  0.380596  0.134127 -0.608756
parch     0.069669  0.038975 -0.085102  0.380596  1.000000  0.191055 -0.570338
fare      0.246669 -0.552440  0.102370  0.134127  0.191055  1.000000 -0.245279
alone    -0.175864  0.112711  0.092418 -0.608756 -0.570338 -0.245279  1.000000

- 생존률 계산

In [40]:
df_1_alive_rate = (df_1['survived'] == 1).sum() / len(df_1['survived'])
print(df_1_alive_rate)

0.3838383838383838

In [41]:
df_2_alive_rate = (df_2['survived'] == 1).sum() / len(df_2['survived'])
print(df_2_alive_rate)

0.4128205128205128

- 생존률이 높은 df_2를 가지고 분석(?)을 해보겠음.

In [42]:
df_2['gender'].value_counts()

gender
man      448
woman    250
girl      42
boy       40
Name: count, dtype: int64

In [43]:
df_2_alive_rate_man = ((df_2['survived'] == 1) & (df_2['gender'] == 'man')).sum() / (df_2['gender'] == 'man').sum()
df_2_alive_rate_woman = ((df_2['survived'] == 1) & (df_2['gender'] == 'woman')).sum() /(df_2['gender'] == 'woman').sum()
df_2_alive_rate_boy = ((df_2['survived'] == 1) & (df_2['gender'] == 'boy')).sum() / (df_2['gender'] == 'boy').sum()
df_2_alive_rate_girl = ((df_2['survived'] == 1) % (df_2['gender'] == 'girl')).sum() / (df_2['gender'] == 'girl').sum()

print(df_2_alive_rate_man, df_2_alive_rate_woman, df_2_alive_rate_boy, df_2_alive_rate_girl, sep='\n\n')

0.18973214285714285

0.756

0.525

0.0

- 성인남자와 여자아이의 경우 생존률이 50%를 넘지 못함.
- 반면에 성인여성과 남자아이의 경우 생존률이 50%를 넘음.

In [44]:
df_2.loc[((df_2['survived'] == 1) & (df_2['gender'] == 'woman'))]

     survived  pclass   age  sibsp  parch     fare  embark_town  alone gender
1           1       1  38.0      1      0  71.2833    Cherbourg  False  woman
2           1       3  26.0      0      0   7.9250  Southampton   True  woman
3           1       1  35.0      1      0  53.1000  Southampton  False  woman
8           1       3  27.0      0      2  11.1333  Southampton  False  woman
11          1       1  58.0      0      0  26.5500  Southampton   True  woman
..        ...     ...   ...    ...    ...      ...          ...    ...    ...
871         1       1  47.0      1      1  52.5542  Southampton  False  woman
874         1       2  28.0      1      0  24.0000    Cherbourg  False  woman
879         1       1  56.0      0      1  83.1583    Cherbourg  False  woman
880         1       2  25.0      0      1  26.0000  Southampton  False  woman
887         1       1  19.0      0      0  30.0000  Southampton   True  woman

[189 rows x 9 columns]

In [45]:
feature_1 = ((df_2['survived'] == 1) & (df_2['gender'] == 'woman')) # 살아남은 성인여성

In [46]:
woman_alone_alive_rate = (feature_1 & (df_2['alone']==True)).sum() / feature_1.sum()
print(woman_alone_alive_rate)   # 살아남은 성인여자 중에서는 거의 반반

0.43915343915343913

In [47]:
woman_first_class_alive_rate = (feature_1 & (df_2['pclass'] == 1)).sum() / feature_1.sum()
woman_second_class_alive_rate = (feature_1 & (df_2['pclass'] == 2)).sum() / feature_1.sum()
woman_third_class_alive_rate = (feature_1 & (df_2['pclass'] == 3)).sum() / feature_1.sum()

print(woman_first_class_alive_rate, woman_second_class_alive_rate, woman_third_class_alive_rate, sep='\n\n')
# 살아남은 사람들 중에서는 1등석, 2등석, 3등석 순으로 생존률이 높음. 1등석은 거의 47%의 생존률을 보여줌.

0.4656084656084656

0.2962962962962963

0.23809523809523808

In [48]:
feature_2 = ((df_2['survived'] == 1) & (df_2['gender'] == 'boy'))   # 살아남은 남자아이

In [49]:
boy_alone_allive_rate = (feature_2 & (df_2['alone'] == True)).sum() / feature_2.sum()
print(boy_alone_allive_rate)    # 가족들고 함께

0.0

In [50]:
boy_first_class_alive_rate = (feature_2 & (df_2['pclass'] == 1)).sum() / feature_2.sum()
boy_second_class_alive_rate = (feature_2 & (df_2['pclass'] == 2)).sum() / feature_2.sum()
boy_third_class_alive_rate = (feature_2 & (df_2['pclass'] == 3)).sum() / feature_2.sum()

print(boy_first_class_alive_rate, boy_second_class_alive_rate, boy_third_class_alive_rate, sep='\n\n')

0.14285714285714285

0.42857142857142855

0.42857142857142855

- 생존율은 성인여성, 남자아이, 성인남성, 여자아이 순으로 나타났음.
- 성인여성은 가족들과 있었을때 생존률이 약 56% 를 보였고 class가 높을수록 생존율 또한 높아지는 모습이 보였음
- 남자아이의 경우는 가족과 있었을때가 높은 생존률을 보였음. class는 성인 여성과 반대로 나타났음.

In [51]:
df_2.info() # sibsp, parch, alone을 정리할 수 있다는 생각이 들어서 정리

<class 'pandas.core.frame.DataFrame'>
Index: 780 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     780 non-null    int64
 1   pclass       780 non-null    int64
 2   age          780 non-null    float64
 3   sibsp        780 non-null    int64
 4   parch        780 non-null    int64
 5   fare         780 non-null    float64
 6   embark_town  780 non-null    object
 7   alone        780 non-null    bool
 8   gender       780 non-null    object
dtypes: bool(1), float64(2), int64(4), object(2)
memory usage: 55.6+ KB

In [81]:
# alone을 기준으로 정리
df_2.loc[:,'family'] = 0

In [85]:
alone = ((df_2['alone'] == True) & (df_2['sibsp'] == 0) & (df_2['parch'] == 0))
alone_idx = alone.index
# df_2.loc[alone_idx, 'family'] = 'one'

family = ((df_2['alone'] == False) & (df_2['sibsp'] != 0) | (df_2['parch'] != 0))
family_idx = family.index
# df_2.loc[family_idx, 'family'] = 'family'

In [82]:
df_2['family'].value_counts()

family
0    780
Name: count, dtype: int64

In [80]:
df_2.head()

,survived,pclass,age,sibsp,parch,fare,embark_town,alone,gender,family
0,0,3,22.0,1,0,7.2500,Southampton,False,man,family
1,1,1,38.0,1,0,71.2833,Cherbourg,False,woman,family
2,1,3,26.0,0,0,7.9250,Southampton,True,woman,family
3,1,1,35.0,1,0,53.1000,Southampton,False,woman,family
4,0,3,35.0,0,0,8.0500,Southampton,True,man,family

In [86]:
print(alone_idx, family_idx, sep='\n\n')    # 뭔가.. 왜 분류가 이렇누...

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       879, 880, 881, 882, 883, 885, 887, 888, 889, 890],
      dtype='int64', length=780)

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       879, 880, 881, 882, 883, 885, 887, 888, 889, 890],
      dtype='int64', length=780)

In [87]:
# 전처리 과정이 부족했음. 뭘 분석을 해보고 싶었던 걸까?
# 뭔가 아쉬워서 새롭게 다시 정리를 해보고 싶음.